# Вам доступен список athletes, содержащий сведения о спортсменах в виде кортежей: 
# (имя, возраст, рост, вес).

# Напишите программу сортировки списка спортсменов по указанному полю:

#     1: по имени;
#     2: по возрасту;
#     3: по росту;
#     4: по весу.


athletes = [('Дима', 10, 130, 35), 
            ('Тимур', 11, 135, 39), 
            ('Руслан', 9, 140, 33), 
            ('Рустам', 10, 128, 30), 
            ('Амир', 16, 170, 70), 
            ('Рома', 16, 188, 100), 
            ('Матвей', 17, 168, 68), 
            ('Петя', 15, 190, 90)]

def f1(args):
    return args[0]
def f2(args):
    return args[1]
def f3(args):
    return args[2]
def f4(args):
    return args[3]

sorting = {1: f1, 2: f2, 3: f3, 4: f4}

for i in sorted(athletes, key = sorting[int(input())]):
    print(*i)


